<policyDefinitions revision="1.0" schemaVersion="1.0">
  <policyNamespaces>
    <target prefix="fullarmor" namespace="FullArmor.Policies.B609A0F0_9E7D_45C8_9DDF_C01B500ACBD8" />
    <using prefix="windows" namespace="Microsoft.Policies.Windows" />
  </policyNamespaces>
  <supersededAdm fileName="" />
  <resources minRequiredRevision="1.0" />
  <supportedOn>
    <definitions>
      <definition name="SUPPORTED_Windows_10_0" displayName="$(string.SUPPORTED_Windows_10_0)" />
    </definitions>
  </supportedOn>
  <categories>
    <category name="CAT_427FDEB4_0BE3_47C9_897A_F074E016758B" displayName="$(string.CAT_427FDEB4_0BE3_47C9_897A_F074E016758B)" />
    <category name="CAT_7936670B_8E03_454A_A995_1379FF4D4738" displayName="$(string.CAT_7936670B_8E03_454A_A995_1379FF4D4738)" explainText="$(string.CAT_7936670B_8E03_454A_A995_1379FF4D4738_Help)">
      <parentCategory ref="CAT_427FDEB4_0BE3_47C9_897A_F074E016758B" />
    </category>
    <category name="CAT_4F5DD077_6630_442A_9C84_80CEEFF8048E" displayName="$(string.CAT_4F5DD077_6630_442A_9C84_80CEEFF8048E)" explainText="$(string.CAT_4F5DD077_6630_442A_9C84_80CEEFF8048E_Help)">
      <parentCategory ref="CAT_427FDEB4_0BE3_47C9_897A_F074E016758B" />
    </category>
  </categories>
  <policies>
    <policy name="POL_1971C8C5_35F5_4D75_BE91_76C75D0D77D0" class="User" displayName="$(string.POL_1971C8C5_35F5_4D75_BE91_76C75D0D77D0)" explainText="$(string.POL_1971C8C5_35F5_4D75_BE91_76C75D0D77D0_Help)" key="Software\github.trondr\Compliance.Notifications\DiskSpaceCheck" valueName="Disabled">
      <parentCategory ref="CAT_427FDEB4_0BE3_47C9_897A_F074E016758B" />
      <supportedOn ref="SUPPORTED_Windows_10_0" />
    </policy>
    <policy name="POL_EFC3B8ED_6B12_4847_A863_C1A61513DC15" class="User" displayName="$(string.POL_EFC3B8ED_6B12_4847_A863_C1A61513DC15)" explainText="$(string.POL_EFC3B8ED_6B12_4847_A863_C1A61513DC15_Help)" presentation="$(presentation.POL_EFC3B8ED_6B12_4847_A863_C1A61513DC15)" key="Software\github.trondr\Compliance.Notifications\DiskSpaceCheck" valueName="RequiredFreeDiskSpace">
      <parentCategory ref="CAT_7936670B_8E03_454A_A995_1379FF4D4738" />
      <supportedOn ref="SUPPORTED_Windows_10_0" />
      <elements>
        <decimal id="DXT_0111451D_AE4A_4327_988E_0E67F1030953" key="Software\github.trondr\Compliance.Notifications\DiskSpaceCheck" valueName="RequiredFreeDiskSpace" minValue="5" />
      </elements>
    </policy>
    <policy name="POL_315AEE27_3D8D_4679_A63F_47792344858C" class="User" displayName="$(string.POL_315AEE27_3D8D_4679_A63F_47792344858C)" explainText="$(string.POL_315AEE27_3D8D_4679_A63F_47792344858C_Help)" presentation="$(presentation.POL_315AEE27_3D8D_4679_A63F_47792344858C)" key="Software\github.trondr\Compliance.Notifications\DiskSpaceCheck" valueName="SubtractSccmCache">
      <parentCategory ref="CAT_7936670B_8E03_454A_A995_1379FF4D4738" />
      <supportedOn ref="SUPPORTED_Windows_10_0" />
      <elements>
        <boolean id="CHK_05F05809_3570_4862_9371_7115F07604F1" key="Software\github.trondr\Compliance.Notifications\DiskSpaceCheck" valueName="SubtractSccmCache">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
        </boolean>
      </elements>
    </policy>
    <policy name="POL_383F49BE_67B7_4E8C_83F6_67DE411CC4F9" class="User" displayName="$(string.POL_383F49BE_67B7_4E8C_83F6_67DE411CC4F9)" explainText="$(string.POL_383F49BE_67B7_4E8C_83F6_67DE411CC4F9_Help)" key="Software\github.trondr\Compliance.Notifications\PendingRebootCheck" valueName="Disabled">
      <parentCategory ref="CAT_427FDEB4_0BE3_47C9_897A_F074E016758B" />
      <supportedOn ref="windows:SUPPORTED_WindowsVista" />
    </policy>
    <policy name="POL_2F12BF2B_F5F7_43D5_8165_765D40195887" class="User" displayName="$(string.POL_2F12BF2B_F5F7_43D5_8165_765D40195887)" explainText="$(string.POL_2F12BF2B_F5F7_43D5_8165_765D40195887_Help)" key="Software\github.trondr\Compliance.Notifications\PendingRebootCheck" valueName="DisableRebootSourcePendingFileRenameOperations">
      <parentCategory ref="CAT_4F5DD077_6630_442A_9C84_80CEEFF8048E" />
      <supportedOn ref="SUPPORTED_Windows_10_0" />
    </policy>
    <policy name="POL_92C8866A_D9F7_47D0_8F46_2EFEB27F8C8F" class="User" displayName="$(string.POL_92C8866A_D9F7_47D0_8F46_2EFEB27F8C8F)" explainText="$(string.POL_92C8866A_D9F7_47D0_8F46_2EFEB27F8C8F_Help)" key="Software\github.trondr\Compliance.Notifications\PendingRebootCheck" valueName="DisableRebootSourceSccmClient">
      <parentCategory ref="CAT_4F5DD077_6630_442A_9C84_80CEEFF8048E" />
      <supportedOn ref="SUPPORTED_Windows_10_0" />
    </policy>
    <policy name="POL_31B89071_802C_4D69_A419_37FECD659AF5" class="User" displayName="$(string.POL_31B89071_802C_4D69_A419_37FECD659AF5)" explainText="$(string.POL_31B89071_802C_4D69_A419_37FECD659AF5_Help)" key="Software\github.trondr\Compliance.Notifications\PendingRebootCheck" valueName="DisableRebootSourceWindowsUpdate">
      <parentCategory ref="CAT_4F5DD077_6630_442A_9C84_80CEEFF8048E" />
      <supportedOn ref="SUPPORTED_Windows_10_0" />
    </policy>
    <policy name="POL_2686D083_0D4D_49CC_9E01_0410F8AAD16A" class="User" displayName="$(string.POL_2686D083_0D4D_49CC_9E01_0410F8AAD16A)" explainText="$(string.POL_2686D083_0D4D_49CC_9E01_0410F8AAD16A_Help)" key="Software\github.trondr\Compliance.Notifications\PendingRebootCheck" valueName="DisableRebootSourceComponentBasedServicing">
      <parentCategory ref="CAT_4F5DD077_6630_442A_9C84_80CEEFF8048E" />
      <supportedOn ref="SUPPORTED_Windows_10_0" />
    </policy>
    <policy name="POL_F421E489_0680_4967_8C07_7763DEED6C58" class="User" displayName="$(string.POL_F421E489_0680_4967_8C07_7763DEED6C58)" explainText="$(string.POL_F421E489_0680_4967_8C07_7763DEED6C58_Help)" presentation="$(presentation.POL_F421E489_0680_4967_8C07_7763DEED6C58)" key="Software\Microsoft\Windows\CurrentVersion\Notifications\Settings\github.com.trondr.Compliance.Notifications" valueName="Enabled">
      <parentCategory ref="CAT_427FDEB4_0BE3_47C9_897A_F074E016758B" />
      <supportedOn ref="SUPPORTED_Windows_10_0" />
      <elements>
        <boolean id="CHK_48AE66EF_F8E0_44E8_92C0_01220551FD37" key="Software\Microsoft\Windows\CurrentVersion\Notifications\Settings\github.com.trondr.Compliance.Notifications" valueName="Enabled">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
        </boolean>
      </elements>
    </policy>
  </policies>
</policyDefinitions>