<policyDefinitions revision="1.0" schemaVersion="1.0">
  <policyNamespaces>
    <target prefix="fullarmor" namespace="FullArmor.Policies.014F66D1_DD16_4415_B36E_CE602A34E8AA" />
    <using prefix="windows" namespace="Microsoft.Policies.Windows" />
  </policyNamespaces>
  <supersededAdm fileName="" />
  <resources minRequiredRevision="1.0" />
  <supportedOn>
    <definitions>
      <definition name="SUPPORTED_Windows_10_0" displayName="$(string.SUPPORTED_Windows_10_0)" />
    </definitions>
  </supportedOn>
  <categories>
    <category name="CAT_427FDEB4_0BE3_47C9_897A_F074E016758B" displayName="$(string.CAT_427FDEB4_0BE3_47C9_897A_F074E016758B)" />
    <category name="CAT_7936670B_8E03_454A_A995_1379FF4D4738" displayName="$(string.CAT_7936670B_8E03_454A_A995_1379FF4D4738)" explainText="$(string.CAT_7936670B_8E03_454A_A995_1379FF4D4738_Help)">
      <parentCategory ref="CAT_427FDEB4_0BE3_47C9_897A_F074E016758B" />
    </category>
    <category name="CAT_4F5DD077_6630_442A_9C84_80CEEFF8048E" displayName="$(string.CAT_4F5DD077_6630_442A_9C84_80CEEFF8048E)" explainText="$(string.CAT_4F5DD077_6630_442A_9C84_80CEEFF8048E_Help)">
      <parentCategory ref="CAT_427FDEB4_0BE3_47C9_897A_F074E016758B" />
    </category>
    <category name="CAT_C0BDA19A_BCA9_484C_A66F_58BD6B847EE8" displayName="$(string.CAT_C0BDA19A_BCA9_484C_A66F_58BD6B847EE8)">
      <parentCategory ref="CAT_427FDEB4_0BE3_47C9_897A_F074E016758B" />
    </category>
    <category name="CAT_75FEFBCF_BB01_4E07_8453_25CFF09DAFBE" displayName="$(string.CAT_75FEFBCF_BB01_4E07_8453_25CFF09DAFBE)">
      <parentCategory ref="CAT_427FDEB4_0BE3_47C9_897A_F074E016758B" />
    </category>
    <category name="CAT_7FCD002A_89CF_450C_9BA7_F9692F4C745E" displayName="$(string.CAT_7FCD002A_89CF_450C_9BA7_F9692F4C745E)">
      <parentCategory ref="CAT_427FDEB4_0BE3_47C9_897A_F074E016758B" />
    </category>
  </categories>
  <policies>
    <policy name="POL_1971C8C5_35F5_4D75_BE91_76C75D0D77D0" class="Machine" displayName="$(string.POL_1971C8C5_35F5_4D75_BE91_76C75D0D77D0)" explainText="$(string.POL_1971C8C5_35F5_4D75_BE91_76C75D0D77D0_Help)" key="Software\github.trondr\Compliance.Notifications\DiskSpaceCheck" valueName="Disabled">
      <parentCategory ref="CAT_427FDEB4_0BE3_47C9_897A_F074E016758B" />
      <supportedOn ref="SUPPORTED_Windows_10_0" />
    </policy>
    <policy name="POL_EFC3B8ED_6B12_4847_A863_C1A61513DC15" class="Machine" displayName="$(string.POL_EFC3B8ED_6B12_4847_A863_C1A61513DC15)" explainText="$(string.POL_EFC3B8ED_6B12_4847_A863_C1A61513DC15_Help)" presentation="$(presentation.POL_EFC3B8ED_6B12_4847_A863_C1A61513DC15)" key="Software\github.trondr\Compliance.Notifications\DiskSpaceCheck" valueName="RequiredFreeDiskSpace">
      <parentCategory ref="CAT_7936670B_8E03_454A_A995_1379FF4D4738" />
      <supportedOn ref="SUPPORTED_Windows_10_0" />
      <elements>
        <decimal id="DXT_0111451D_AE4A_4327_988E_0E67F1030953" key="Software\github.trondr\Compliance.Notifications\DiskSpaceCheck" valueName="RequiredFreeDiskSpace" minValue="5" />
      </elements>
    </policy>
    <policy name="POL_315AEE27_3D8D_4679_A63F_47792344858C" class="Machine" displayName="$(string.POL_315AEE27_3D8D_4679_A63F_47792344858C)" explainText="$(string.POL_315AEE27_3D8D_4679_A63F_47792344858C_Help)" presentation="$(presentation.POL_315AEE27_3D8D_4679_A63F_47792344858C)" key="Software\github.trondr\Compliance.Notifications\DiskSpaceCheck" valueName="SubtractSccmCache">
      <parentCategory ref="CAT_7936670B_8E03_454A_A995_1379FF4D4738" />
      <supportedOn ref="SUPPORTED_Windows_10_0" />
      <elements>
        <boolean id="CHK_05F05809_3570_4862_9371_7115F07604F1" key="Software\github.trondr\Compliance.Notifications\DiskSpaceCheck" valueName="SubtractSccmCache">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
        </boolean>
      </elements>
    </policy>
    <policy name="POL_383F49BE_67B7_4E8C_83F6_67DE411CC4F9" class="Machine" displayName="$(string.POL_383F49BE_67B7_4E8C_83F6_67DE411CC4F9)" explainText="$(string.POL_383F49BE_67B7_4E8C_83F6_67DE411CC4F9_Help)" key="Software\github.trondr\Compliance.Notifications\PendingRebootCheck" valueName="Disabled">
      <parentCategory ref="CAT_427FDEB4_0BE3_47C9_897A_F074E016758B" />
      <supportedOn ref="windows:SUPPORTED_WindowsVista" />
    </policy>
    <policy name="POL_2F12BF2B_F5F7_43D5_8165_765D40195887" class="Machine" displayName="$(string.POL_2F12BF2B_F5F7_43D5_8165_765D40195887)" explainText="$(string.POL_2F12BF2B_F5F7_43D5_8165_765D40195887_Help)" key="Software\github.trondr\Compliance.Notifications\PendingRebootCheck" valueName="DisableRebootSourcePendingFileRenameOperations">
      <parentCategory ref="CAT_4F5DD077_6630_442A_9C84_80CEEFF8048E" />
      <supportedOn ref="SUPPORTED_Windows_10_0" />
    </policy>
    <policy name="POL_92C8866A_D9F7_47D0_8F46_2EFEB27F8C8F" class="Machine" displayName="$(string.POL_92C8866A_D9F7_47D0_8F46_2EFEB27F8C8F)" explainText="$(string.POL_92C8866A_D9F7_47D0_8F46_2EFEB27F8C8F_Help)" key="Software\github.trondr\Compliance.Notifications\PendingRebootCheck" valueName="DisableRebootSourceSccmClient">
      <parentCategory ref="CAT_4F5DD077_6630_442A_9C84_80CEEFF8048E" />
      <supportedOn ref="SUPPORTED_Windows_10_0" />
    </policy>
    <policy name="POL_31B89071_802C_4D69_A419_37FECD659AF5" class="Machine" displayName="$(string.POL_31B89071_802C_4D69_A419_37FECD659AF5)" explainText="$(string.POL_31B89071_802C_4D69_A419_37FECD659AF5_Help)" key="Software\github.trondr\Compliance.Notifications\PendingRebootCheck" valueName="DisableRebootSourceWindowsUpdate">
      <parentCategory ref="CAT_4F5DD077_6630_442A_9C84_80CEEFF8048E" />
      <supportedOn ref="SUPPORTED_Windows_10_0" />
    </policy>
    <policy name="POL_2686D083_0D4D_49CC_9E01_0410F8AAD16A" class="Machine" displayName="$(string.POL_2686D083_0D4D_49CC_9E01_0410F8AAD16A)" explainText="$(string.POL_2686D083_0D4D_49CC_9E01_0410F8AAD16A_Help)" key="Software\github.trondr\Compliance.Notifications\PendingRebootCheck" valueName="DisableRebootSourceComponentBasedServicing">
      <parentCategory ref="CAT_4F5DD077_6630_442A_9C84_80CEEFF8048E" />
      <supportedOn ref="SUPPORTED_Windows_10_0" />
    </policy>
    <policy name="POL_F421E489_0680_4967_8C07_7763DEED6C58" class="User" displayName="$(string.POL_F421E489_0680_4967_8C07_7763DEED6C58)" explainText="$(string.POL_F421E489_0680_4967_8C07_7763DEED6C58_Help)" presentation="$(presentation.POL_F421E489_0680_4967_8C07_7763DEED6C58)" key="Software\Microsoft\Windows\CurrentVersion\Notifications\Settings\github.com.trondr.Compliance.Notifications" valueName="Enabled">
      <parentCategory ref="CAT_427FDEB4_0BE3_47C9_897A_F074E016758B" />
      <supportedOn ref="SUPPORTED_Windows_10_0" />
      <elements>
        <boolean id="CHK_48AE66EF_F8E0_44E8_92C0_01220551FD37" key="Software\Microsoft\Windows\CurrentVersion\Notifications\Settings\github.com.trondr.Compliance.Notifications" valueName="Enabled">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
        </boolean>
      </elements>
    </policy>
    <policy name="POL_D839704A_13AC_4A28_BB3D_5E1CDF702D3D" class="User" displayName="$(string.POL_D839704A_13AC_4A28_BB3D_5E1CDF702D3D)" explainText="$(string.POL_D839704A_13AC_4A28_BB3D_5E1CDF702D3D_Help)" presentation="$(presentation.POL_D839704A_13AC_4A28_BB3D_5E1CDF702D3D)" key="Software\Microsoft\Windows\CurrentVersion\PushNotifications" valueName="ToastEnabled">
      <parentCategory ref="CAT_427FDEB4_0BE3_47C9_897A_F074E016758B" />
      <supportedOn ref="windows:SUPPORTED_WindowsVista" />
      <elements>
        <boolean id="CHK_0F3A0CD7_C829_46B4_A4E0_4ADE7C849E66" key="Software\Microsoft\Windows\CurrentVersion\PushNotifications" valueName="ToastEnabled">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
        </boolean>
      </elements>
    </policy>
    <policy name="POL_E6813C56_4BBA_4F60_8955_462EFF5FB2C0" class="Machine" displayName="$(string.POL_E6813C56_4BBA_4F60_8955_462EFF5FB2C0)" explainText="$(string.POL_E6813C56_4BBA_4F60_8955_462EFF5FB2C0_Help)" presentation="$(presentation.POL_E6813C56_4BBA_4F60_8955_462EFF5FB2C0)" key="Software\github.trondr\Compliance.Notifications\SystemUptimeCheck" valueName="MaxUptimeHours">
      <parentCategory ref="CAT_75FEFBCF_BB01_4E07_8453_25CFF09DAFBE" />
      <supportedOn ref="SUPPORTED_Windows_10_0" />
      <elements>
        <decimal id="DXT_39C7B0E6_5540_44A3_9B84_6D4DFE951AC8" key="Software\github.trondr\Compliance.Notifications\SystemUptimeCheck" valueName="MaxUptimeHours" minValue="1" />
      </elements>
    </policy>
    <policy name="POL_5B57A76A_7539_4155_A7DC_44F9ADFB54CE" class="Machine" displayName="$(string.POL_5B57A76A_7539_4155_A7DC_44F9ADFB54CE)" explainText="$(string.POL_5B57A76A_7539_4155_A7DC_44F9ADFB54CE_Help)" key="Software\github.trondr\Compliance.Notifications\SystemUptimeCheck" valueName="Disabled">
      <parentCategory ref="CAT_427FDEB4_0BE3_47C9_897A_F074E016758B" />
      <supportedOn ref="windows:SUPPORTED_WindowsVista" />
    </policy>
    <policy name="POL_EF1E8D3E_4D0A_4B4F_B51B_43558D143AD5" class="Machine" displayName="$(string.POL_EF1E8D3E_4D0A_4B4F_B51B_43558D143AD5)" explainText="$(string.POL_EF1E8D3E_4D0A_4B4F_B51B_43558D143AD5_Help)" key="Software\github.trondr\Compliance.Notifications\PasswordExpiryCheck" valueName="Disabled">
      <parentCategory ref="CAT_427FDEB4_0BE3_47C9_897A_F074E016758B" />
      <supportedOn ref="windows:SUPPORTED_WindowsVista" />
    </policy>
    <policy name="POL_80BCDF65_3981_4EE7_AD8D_D61034F05621" class="Machine" displayName="$(string.POL_80BCDF65_3981_4EE7_AD8D_D61034F05621)" explainText="$(string.POL_80BCDF65_3981_4EE7_AD8D_D61034F05621_Help)" presentation="$(presentation.POL_80BCDF65_3981_4EE7_AD8D_D61034F05621)" key="SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon" valueName="PasswordExpiryWarning">
      <parentCategory ref="CAT_C0BDA19A_BCA9_484C_A66F_58BD6B847EE8" />
      <supportedOn ref="SUPPORTED_Windows_10_0" />
      <elements>
        <decimal id="DXT_BBF3BAE7_CAE9_4E6A_9477_CAC01A61018F" key="SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon" valueName="PasswordExpiryWarning" />
      </elements>
    </policy>
    <policy name="POL_74553E7F_F584_4420_AD33_E058561EF1BA" class="Machine" displayName="$(string.POL_74553E7F_F584_4420_AD33_E058561EF1BA)" explainText="$(string.POL_74553E7F_F584_4420_AD33_E058561EF1BA_Help)" presentation="$(presentation.POL_74553E7F_F584_4420_AD33_E058561EF1BA)" key="Software\Policies\github.trondr\Compliance.Notifications\DesktopDataCheck" valueName="Disabled">
      <parentCategory ref="CAT_427FDEB4_0BE3_47C9_897A_F074E016758B" />
      <supportedOn ref="SUPPORTED_Windows_10_0" />
	  <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="POL_3BC0976A_0DAD_464B_A0CE_8B6AB6D439B3" class="User" displayName="$(string.POL_3BC0976A_0DAD_464B_A0CE_8B6AB6D439B3)" explainText="$(string.POL_3BC0976A_0DAD_464B_A0CE_8B6AB6D439B3_Help)" presentation="$(presentation.POL_3BC0976A_0DAD_464B_A0CE_8B6AB6D439B3)" key="Software\Policies\github.trondr\Compliance.Notifications">
      <parentCategory ref="CAT_427FDEB4_0BE3_47C9_897A_F074E016758B" />
      <supportedOn ref="windows:SUPPORTED_WindowsVista" />
      <elements>
        <enum id="DST_421420F1_A191_4262_BE39_73C6CB9C6DF4" key="Software\Policies\github.trondr\Compliance.Notifications" valueName="UserInterfaceCulture">
          <item displayName="$(string.ITM_AB57B729_6578_43C4_8BAA_E8C223D57420)">
            <value>
              <string>nb-NO</string>
            </value>
          </item>
          <item displayName="$(string.ITM_235D1690_D3ED_42EA_9B12_A2F51780359D)">
            <value>
              <string>sv-SE</string>
            </value>
          </item>
          <item displayName="$(string.ITM_E0D20E35_E023_4F31_BBEF_0667CFB0C420)">
            <value>
              <string>fi-FI</string>
            </value>
          </item>
          <item displayName="$(string.ITM_017B71F3_E68B_4945_9DDC_28E990291EAE)">
            <value>
              <string>en-US</string>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
  </policies>
</policyDefinitions>